OpenFOAM-7/chapter5/propeller/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0047;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0047;
        value           uniform 0.0047;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.0047;
    }
    sides
    {
        type            inletOutlet;
        inletValue      uniform 0.0047;
        value           uniform 0.0047;
    }
    propeller
    {
        type            epsilonWallFunction;
        value           uniform 0.0047;
    }
}


// ************************************************************************* //
