OpenFOAM-7/chapter5/propeller/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.09375;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.09375;
        value           uniform 0.09375;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.09375;
    }
    sides
    {
        type            inletOutlet;
        inletValue      uniform 0.09375;
        value           uniform 0.09375;
    }
    propeller
    {
        type            kqRWallFunction;
        value           uniform 0.09375;
    }
}


// ************************************************************************* //
